circuitbreaker/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1e-3;



boundaryField
{
       "(top|frontAndBack|bottom|external.*|internal.*|plates.*)"
        {
       type            compressible::alphatWallFunction;
        value           $internalField;
    }

    "(inlet|outlet)"
    {
         type            calculated;
        value           $internalField;
    }

}



// ************************************************************************* //
