circuitbreaker/system/snappygeometry
parts2_v1.stl { type triSurfaceMesh; name external1; } 
